#!/bin/bash

user1="******"
PW1="******"
user2="******"
PW2="******"
user3="******"
PW3="******"
GIT_COM_HOSNAME=
GIT_SSH_SECRET_KEY_NAME=

#################################

if [ "`id | grep root`" = "" ]
then
    echo "root de execute sitene!"
    exit 1
fi

############
# user1
############

su - $user1
ssh -i ~/.ssh/$GIT_SSH_SECRET_KEY_NAME -T git@github.com

if [ $? = 0 ];then
    echo "#------------------------------------------------------------------------"
    echo " 正常に $user1 ユーザがgithubに疎通が取れました"
    echo "#------------------------------------------------------------------------"
else
    echo "#------------------------------------------------------------------------"
    echo " $user1 ユーザがgithubに疎通が取れませんでした。\n"
    echo "#------------------------------------------------------------------------"
fi

sudo su - 

############
# user2
############

su - $user2
ssh -i ~/.ssh/$GIT_SSH_SECRET_KEY_NAME -T git@github.com
if [ $? = 0 ];then
    echo "#------------------------------------------------------------------------"
    echo " 正常に $user2 ユーザがgithubに疎通が取れました"
    echo "#------------------------------------------------------------------------"
else
    echo "#------------------------------------------------------------------------"
    echo " $user2 ユーザがgithubに疎通が取れませんでした。\n"
    echo "#------------------------------------------------------------------------"
fi

sudo su -

############
# user3
############

su - $user3
ssh -i ~/.ssh/$GIT_SSH_SECRET_KEY_NAME -T git@github.com

if [ $? = 0 ];then
    echo "#------------------------------------------------------------------------"
    echo " 正常に $user3 ユーザがgithubに疎通が取れました"
    echo "#------------------------------------------------------------------------"
else
    echo "#------------------------------------------------------------------------"
    echo " $user3 ユーザがgithubに疎通が取れませんでした。\n"
    echo "#------------------------------------------------------------------------"
fi
